tutorials/interTrackFoam/hydrofoil/constant/dynamicMeshDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.0                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          meshMotionDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

twoDMotion          yes;

solver              laplaceTetDecomposition;

diffusivity         patchEnhanced;

distancePatches     1 (freeSurface);

frozenDiffusion     yes;


pseudoSolid
{
    poissonsRatio           0.3;
    nCorrectors             3;
    convergenceTolerance    1e-9;
};

// ************************************************************************* //
