tutorials/interTrackFoam/hydrofoil/system/controlDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.0                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          controlDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

applicationClass    interTrackFoam;

startFrom           startTime;

startTime           0;

stopAt              endTime;

endTime             6.0;

deltaT              0.005;

writeControl        runTime;

writeInterval       0.2;

cycleWrite          0;

writeFormat         ascii;

writeCompression    compressed;

timeFormat          general;

timePrecision       6;

runTimeModifiable   yes;

// ************************************************************************* //


